bryamzxz/tinylink/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# Copyright (c) 2026 Bryam (bryamzxz)
#
# tinylink default sdkconfig — common to all ESP32 variants.
# Per-target overrides live in sdkconfig.defaults.<target>.
#
# Hardening + tuning baseline for ESP-IDF v5.5.x.

# ---- Target / flash / partition table ----------------------------------------
# partitions.csv places ota_1 at 0x320000 + a 0x4000 nvs_creds region, so flash
# must be ≥ 4 MB (ESP32-WROOM-32E and friends ship with 4 MB).
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---- WiFi tuning (single-STA, low memory) ------------------------------------
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# ---- Power management --------------------------------------------------------
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# ---- mbedTLS minimal config (TLS + crypto for ts2021/DERP) -------------------
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
CONFIG_MBEDTLS_HKDF_C=y
# Heap budget for two simultaneous TLS conns (long-poll + DERP
# supervisor) — comments revised 2026-05-06 against forensic notes
# in ~/.claude/projects/-home-bryam-dev-tinylink/memory/reference_tinylink_supervised_heap.md
# and the followup compass artifact at ~/Descargas/compass_artifact_*.
#
# 1. DYNAMIC_BUFFER stays OFF.
#    The earlier "DYNAMIC_BUFFER=y unlocks supervisor=y" experiment
#    (PR #20, 512f772) passed a 90 s soak but conflicts with two
#    documented IDF bugs: PR #14614 / IDFGH-13752 (heap corruption
#    when DYNAMIC_BUFFER + IN_CONTENT_LEN<16384) and #15984 (TLS 1.3
#    panics with DYNAMIC_BUFFER on). Plus the 2026-05-02 incident
#    that originally turned it off was corruption mid-write; even if
#    it was tickets-related, we now have safer levers that don't
#    rely on it.
# 2. SESSION_TICKETS back ON.
#    Tailscale's control plane GOAWAYs the long-poll every ~2 min;
#    each reconnect needs a fresh TLS handshake. With a valid
#    NewSessionTicket the resumed handshake skips the Certificate
#    message — saves ~10 KiB on the transient peak (no cert chain
#    verify, no RSA-2048 of the LE intermediate). Bigger lever than
#    DYNAMIC_BUFFER's ~5 KiB, on a recurring rather than one-time
#    event.
# 3. IN_CONTENT_LEN stays at 16384.
#    Go's crypto/tls (what controlplane.tailscale.com runs) emits
#    TLS records up to 16384 plaintext, regardless of the application
#    layer's frame sizes. Lowering IN below 16384 would surface as
#    record_overflow alerts on a large keepalive or the first
#    MapResponse. Confirmed by microlink/esphome-tailscale needing
#    PSRAM precisely because of this floor.
# 4. OUT_CONTENT_LEN drops 4096 → 2048.
#    tinylink emits short frames in both directions: MapRequest is
#    ~500 B-2 KiB, DERP frames are <1500 B WG packets. 2 KiB is
#    enough headroom and saves 2 KiB per conn × 2 conns = 4 KiB.
# 5. KEEP_PEER_CERTIFICATE stays OFF (was already n).
#    Saves ~2 KiB per conn — we don't introspect certs after verify.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=n
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y

# ---- lwIP tunings ------------------------------------------------------------
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=n
CONFIG_LWIP_TCP_SACK_OUT=n
CONFIG_LWIP_TCP_MSS=1440

# PPP netstack used by tinylink_wg's lwIP integration (wg_lwip.c) for
# the point-to-point WG tunnel netif. We don't actually run PPP — we
# need ESP_NETIF_NETSTACK_DEFAULT_PPP as the base netstack template
# (raw IP, no link layer, no DHCP triggers). Enabling PPP costs ~10
# KiB flash; turning it on lets esp_netif register our custom netif
# without the DHCP-callback collision that killed trombik on IDF v5.5.
CONFIG_LWIP_PPP_SUPPORT=y

# ---- NVS encryption ----------------------------------------------------------
CONFIG_NVS_ENCRYPTION=y

# ---- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# ---- FreeRTOS ----------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ---- TLS to control plane ----------------------------------------------------
# tinylink talks ts2021 over TLS to controlplane.tailscale.com. We use
# esp_tls on top of mbedtls and verify against the IDF certificate bundle.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_ESP_TLS_USE_SECURE_ELEMENT=n
CONFIG_ESP_TLS_INSECURE=n
CONFIG_MBEDTLS_POLY1305_C=y

# ---- App task stacks ---------------------------------------------------------
# Bigger main stack: TLS + Noise IK + JSON construction is much heavier than
# the M1-WG bringup that this replaces. Verified on-device 2026-05-02:
# the boot-time mbedtls cert-chain verification + ECDSA + Noise IK init
# in tinylink_register peaks at ~14 KiB; bumped from 16 K to 24 K to give
# margin. The long-poll task in tinylink.c::tinylink_long_poll_start
# also xTaskCreate's at 24 KiB to absorb the same workload — bug from
# 8 K manifested as random LoadProhibited / Double exception / fake
# heap-corruption asserts.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=24576

# esp_timer dispatch task stack. mbedtls / lwIP timer callbacks (e.g.
# session ticket lifetime, sntp, peer-cert cleanup) routed through here
# blow past the 3584-byte default once TLS to controlplane.tailscale.com
# is up. Observed on first HW boot 2026-05-02: panic with EXCCAUSE 0x1c
# (LoadStoreError) immediately after the control-key fetch path,
# classic stack-overflow corruption. 6144 gives ~2x headroom.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
